<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fdf56b8f43889f49d00ca2775f49a4b5e38fac0e1de6b6131ccac569db7e6246","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #767 at https://github.com/cal-itp/data-infra/actions/runs/18293438405","plan_out_hash":"5f03072008ba5ef341a7c3d9339e18fe26e76b51c4059fa89b36d9b2d691e804","plan_hash":"ce764b1d9ec40f1e2d95054c4184eb93a1acc0b614fecbcf809d89b8f535c28f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_littlepay_v3/eldorado-transit.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/eldorado-transit.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/eldorado-transit.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_littlepay_v3/eldorado-transit.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/eldorado-transit.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/eldorado-transit.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "UlgWJg==" -> (known after apply)
!~      detect_md5hash      = "DjmvIGyBBSptmHxCRbOojw==" -> "different hash"
!~      generation          = 1759360740145293 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "DjmvIGyBBSptmHxCRbOojw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "n4lFJw==" -> (known after apply)
!~      detect_md5hash      = "GO6Tf6lB/8vgk4ra2B4mHg==" -> "different hash"
!~      generation          = 1758296426635304 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "GO6Tf6lB/8vgk4ra2B4mHg==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/payments_entity_mapping.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Bvq4TQ==" -> (known after apply)
!~      detect_md5hash      = "/rW9OXFvsHCGW3BJIsri1w==" -> "different hash"
!~      generation          = 1758233280817951 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/seeds/payments_entity_mapping.csv"
!~      md5hash             = "/rW9OXFvsHCGW3BJIsri1w==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping.csv"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "SDtavA==" -> (known after apply)
!~      detect_md5hash      = "3+r8U+rWI9Zb6A33ax/NMQ==" -> "different hash"
!~      generation          = 1759360741866978 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "3+r8U+rWI9Zb6A33ax/NMQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #767](https://github.com/cal-itp/data-infra/actions/runs/18293438405)